pwbf/RX64M_CANBUS/src/r_can_rx/src/r_can_rx.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS 
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer 
*
* Copyright (C) 2019 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_can_rx.c
* Description  : CAN FIT driver.
************************************************************************************************************************
* History : DD.MM.YYYY Version Description
*         : 08.04.2015 2.01    For 64M, 71M.
*                              - When writing 0 to bits NEWDATA, SENTDATA, MSGLOST, TRMABT, RECREQ, and TRMREQ by a program,
*                              do not use the logic operation instruction (AND). Write 0 to only the specified bit and
*                              write 1 to the other bits before using the transfer (MOV) instruction. See RX64M/71M UM 43.2.8.
*                              - R_CAN_TxCheck() and R_CAN_TxStopMsg() modified because of note "Bits SENTDATA and TRMREQ cannot
*                              be set to 0 simultaneously." See RX64M/71M UM 43.2.8.
*         : 30.10.2015 2.02    - Updates to code packaging for FIT.
*                              - R_CAN_Create(): Added arguments for interrupt callbacks.
*                              - Changed R_CAN_RxRead(): The IDE bit is only valid in mixed mode.
*         : 09.06.2016 2.10    - 65N added.
*                              - Set IDE bit according to requested frame type for mixed ID mode only.
*                              - Fixed R_CAN_RxRead() Mixed mode: Else-block missing. STD frame ID not copied.
*                              - R_CAN_Control()
*                                   o Cases EXITSLEEP_CANMODE and ENTERSLEEP_CANMODE had 0 instead of ch_nr.
*                                   o Case OPERATE_CANMODE: Checking also that Halt Status bit is 0.
*         : 01.30.2017 2.11    - const was added to CAN_port_map_t so that there is no need to add const to instantiations.
*                              - Test ran with 65N 2MB.
*                              - Some GSCE coding guidelines implemented. Mulitple lines changed. (Plugin was used.)
*         : 08.14.2017 2.12    - Fixed CAN_ERS_ISR() function to check interrupt sources for all channels.
*         : 10.26.2018 2.13    - Fixed comment field "Function name:  CAN2_TXM2_ISR" causing compilation error
*                                when CAN2 enabled.
*         : 08.01.2019 2.15    - Fixed default callback assignments for can_rx_callback and can_err_callback.
*         : 05.04.2019 3.00    - Added support for GCC and IAR compilers
*         : 16.09.2019 3.11    - Added macro CAN_USE_CAN0, CAN_USE_CAN1, CAN_USE_CAN2 in config_can_interrupts() function, 
*                                above CAN0_TXM0_ISR(), CAN0_RXM0_ISR(), CAN1_TXM1_ISR(), CAN1_RXM1_ISR(), CAN2_TXM2_ISR() and
*                                CAN2_RXM2_ISR() function to prevent interrupt vector number are undefined when does not
*                                use CAN0 , CAN1 or CAN2.
*         : 30.12.2019 3.20    - Modified comment of API function to Doxygen style.
*                              - Added support for atomic control.
*                              - Removed support for Generation 1 devices.
*                              - Fixed to comply with GSCE Coding Standards Rev.6.00.
***********************************************************************************************************************/
/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
#include <string.h>
#include "platform.h"
#include "r_can_rx_config.h"
#include "r_can_rx_if.h"

/******************************************************************************
Typedef definitions
******************************************************************************/
/******************************************************************************
Macro definitions
******************************************************************************/
/* These macros are for determining if some can while loop times out. If they do,
the canx_sw_err variable will be non zero. This is to prevent an error in the 
can peripheral and driver from blocking the CPU indefinatly. */
#define DEC_CHK_CAN_SW_TMR      (--can_tmo_cnt != 0)
#define MAX_CAN_SW_DELAY        (0x2000)

#define CHECK_MBX_NR            {if (mbox_nr > 31) return R_CAN_SW_BAD_MBX;}


/* Define a mask for MSB of a long to serve as an extended ID mode bit flag. */
/* Extended ID occupies lower 29 bits, so use this to mask off upper 3 bits. */ 
#define XID_MASK                (0xE0000000)

/* Define a mask for the 11 bits that make up a standard ID. */ 
#define SID_MASK                (0x000007FF)

