pwbf/RX64M_CANBUS/src/r_can_rx/src/r_can_rx.c
/******************************************************************************
Global variables and functions imported (externs)
******************************************************************************/
/******************************************************************************
Constant definitions
******************************************************************************/
/* Mem. area for bit set defines */
static const uint32_t  bit_set[32] = 
{
    MBX_0,  MBX_1,  MBX_2,  MBX_3, 
    MBX_4,  MBX_5,  MBX_6,  MBX_7,
    MBX_8,  MBX_9,  MBX_10, MBX_11, 
    MBX_12, MBX_13, MBX_14, MBX_15,
    MBX_16, MBX_17, MBX_18, MBX_19,
    MBX_20, MBX_21, MBX_22, MBX_23, 
    MBX_24, MBX_25, MBX_26, MBX_27,
    MBX_28, MBX_29, MBX_30, MBX_31, 
};

static const can_st_ptr CAN_CHANNELS[] =
{
    #ifdef CAN0
         &CAN0,
    #endif
    #ifdef CAN1      
         &CAN1,
    #endif
    #ifdef CAN2
         &CAN2
    #endif
};

/* make sure that MAX_CHANNELS = the number of CAN channels */
#define MAX_CHANNELS (sizeof(CAN_CHANNELS)/sizeof(can_st_ptr))

/* initialize CAN port map */
static CAN_port_map_t CAN_CHNL_PORTS[] = {
    #ifdef CAN0
        {
        p_CAN0_RX_PIN_MPC,
        p_CAN0_RX_PIN_PMR,
        p_CAN0_RX_PIN_PDR,
        p_CAN0_RX_PIN_PIDR,
          CAN0_RX_PIN_MASK,
        p_CAN0_TX_PIN_MPC, 
        p_CAN0_TX_PIN_PMR,
        p_CAN0_TX_PIN_PDR,
        p_CAN0_TX_PIN_PODR,
          CAN0_TX_PIN_MASK,
        },
    #endif
    #ifdef CAN1
        {
        p_CAN1_RX_PIN_MPC,
        p_CAN1_RX_PIN_PMR,
        p_CAN1_RX_PIN_PDR,
        p_CAN1_RX_PIN_PIDR,
          CAN1_RX_PIN_MASK,
        p_CAN1_TX_PIN_MPC, 
        p_CAN1_TX_PIN_PMR,
        p_CAN1_TX_PIN_PDR,
        p_CAN1_TX_PIN_PODR,
          CAN1_TX_PIN_MASK,
        },
    #endif
    #ifdef CAN2
        {
        p_CAN2_RX_PIN_MPC,
        p_CAN2_RX_PIN_PMR,
        p_CAN2_RX_PIN_PDR,
        p_CAN2_RX_PIN_PIDR,
          CAN2_RX_PIN_MASK,
        p_CAN2_TX_PIN_MPC, 
        p_CAN2_TX_PIN_PMR,
        p_CAN2_TX_PIN_PDR,
        p_CAN2_TX_PIN_PODR,
          CAN2_TX_PIN_MASK,
        }
    #endif
    };

/******************************************************************************
Global variables and functions private to the file
******************************************************************************/
/* Data */
/* Functions */
static uint32_t can_wait_tx_rx(const uint32_t ch_nr, const uint32_t mbox_nr);
static void     config_can_interrupts(const uint32_t ch_nr);
static void     universal_can_callback(void);
static void     can_module_stop_state_cancel(const uint32_t ch_nr);

/* User-function vectors for the CAN interrupts. These will be populated by R_CAN_Create(). */
#ifdef CAN2     /* Three CAN channels exist on device. */
    void (*can_tx_callback[MAX_CHANNELS])(void) = {NULL, NULL, NULL};
    void (*can_rx_callback[MAX_CHANNELS])(void) = {NULL, NULL, NULL};
    void (*can_err_callback[MAX_CHANNELS])(void) = {NULL, NULL, NULL};
#else
#ifdef CAN1     /* Two CAN channels exist. */
    void (*can_tx_callback[MAX_CHANNELS])(void) = {NULL, NULL};
    void (*can_rx_callback[MAX_CHANNELS])(void) = {NULL, NULL};
    void (*can_err_callback[MAX_CHANNELS])(void) = {NULL, NULL};
#else           /* Only one CAN channel on device. */
    void (*can_tx_callback[MAX_CHANNELS])(void) = {NULL};
    void (*can_rx_callback[MAX_CHANNELS])(void) = {NULL};
    void (*can_err_callback[MAX_CHANNELS])(void) = {NULL};
#endif
#endif

/******************************************************************************


                                C A N   A P I


******************************************************************************/
/***********************************************************************************************************************
* Function Name: R_CAN_Create
********************************************************************************************************************//**
* @brief Initializes CAN peripheral - Sets user communication callback functions, configures CAN interrupts, sets
* bitrate, mailbox defaults, and enters CAN Operation Mode.\n
* This function sets the CAN interrupt levels and user callbacks. This function will also call R_CAN_SetBitrate()
* and sets the mask to default: not mask any frames.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] tx_cb_func - The name of a function in your application which will be called by the CAN driver when
* a mailbox has finished transmitting. If you are using polled mode, or do not want a callback for interrupt mode
* for some reason, specify NULL.
* @param[in] rx_cb_func - The name of a function in your application which will be called by the CAN driver when a
* mailbox has finished receiving. If you are using polled mode, or do not want a callback for interrupt mode for
* some reason, specify NULL.t
* @param[in] err_cb_func - The name of a function in your application which will be called by the CAN driver when
* there is a CAN error. If you are using polled mode, or do not want a callback for interrupt mode for some reason,
* specify NULL.
* @retval R_CAN_OK                Action completed successfully.
* @retval R_CAN_SW_BAD_MBX        Bad mailbox number.
* @retval R_CAN_BAD_CH_NR         The channel number does not exist.
* @retval R_CAN_SW_RST_ERR        The CAN peripheral did not enter Reset mode
* @retval R_CAN_MODULE_STOP_ERR   Whole CAN peripheral is in stop state (low power). Perhaps the PRCR register was
* not used to unlock the module stop register.\n
* See also R_CAN_Control() return values.
* @details This function wakes the peripheral from CAN Sleep mode and puts it in CAN Reset mode. It configures the
* mailboxes with these default settings:\n
* Overwrite an unread mailbox data when new frames arrive.\n
* Sets the device to use ID priority (normal CAN behavior, not the optional mailbox number priority).\n
* Sets all mailboxes' masks invalid.\n
* R_CAN_Create calls the R_CAN_SetBitrate function and configures CAN interrupts if USE_CAN_POLL is commented
* in r_can_rx_config.h.\n
* Before returning, it clears all mailboxes, sets the peripheral into Operation mode, and clears any errors.
*/
uint32_t R_CAN_Create(const uint32_t ch_nr, void (*tx_cb_func)(void), void (*rx_cb_func)(void), void (*err_cb_func)(void))
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;
    uint32_t api_status = R_CAN_OK;
    uint32_t i, j;

    /* A faulty CAN peripheral block, due to HW, FW could potentially block (hang)
    the program at a while-loop. To prevent this, a sw timer in the while-loops
    will time out enabling the CPU to continue. */
    uint32_t can_tmo_cnt = MAX_CAN_SW_DELAY;

    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

