pwbf/RX64M_CANBUS/src/r_can_rx/src/r_can_rx.c
        /* Run in Internal Loopback test mode. */
        case CANPORT_TEST_1_INT_LOOPBACK:
            api_status = R_CAN_Control(ch_nr, HALT_CANMODE);
            can_block_p->TCR.BYTE = 0x07;
            api_status |= R_CAN_Control(ch_nr, OPERATE_CANMODE);
        break;

        /* Return to default CAN bus mode. 
        This is the default setting at CAN reset. */
        case CANPORT_RETURN_TO_NORMAL:
            api_status = R_CAN_Control(ch_nr, HALT_CANMODE);
            can_block_p->TCR.BYTE = 0x00;
            api_status |= R_CAN_Control(ch_nr, OPERATE_CANMODE);
            api_status |= R_CAN_PortSet(ch_nr, ENABLE);
        break;

        default:
            /* Bad action type. */
            api_status = R_CAN_BAD_ACTION_TYPE;
        break;
    }
    return (api_status);
}
/******************************************************************************
 End of function R_CAN_PortSet
 *****************************************************************************/ /* end R_CAN_PortSet() */

/***********************************************************************************************************************
* Function Name: R_CAN_Control
********************************************************************************************************************//**
* @brief Set CAN operating modes. Controls transition to CAN operating modes determined by the CAN Control
* register. For example, the Halt mode should be used to later configure a receive mailbox.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] action_type \n
* Peripheral actions:\n
*  EXITSLEEP_CANMODE       Exit CAN Sleep mode, the default state when the peripheral starts up.\n
*  ENTERSLEEP_CANMODE      Enter CAN Sleep mode to save power.\n
*  RESET_CANMODE           Put the CAN peripheral into Reset mode.\n
*  HALT_CANMODE            Put the CAN peripheral into Halt mode. CAN peripheral is still connected to the bus, but stops
*                           communicating.\n
*  OPERATE_CANMODE         Put the CAN peripheral into normal Operation mode.\n
* @retval R_CAN_OK                Action completed successfully.
* @retval R_CAN_SW_BAD_MBX        Bad mailbox number.
* @retval R_CAN_BAD_CH_NR         The channel number does not exist.
* @retval R_CAN_BAD_ACTION_TYPE   No such action type exists for this function.
* @retval R_CAN_SW_WAKEUP_ERR     The CAN peripheral did not wake up from Sleep mode.
* @retval R_CAN_SW_SLEEP_ERR      The CAN peripheral did not enter Sleep mode.
* @retval R_CAN_SW_HALT_ERR       The CAN peripheral did not enter Halt mode.
* @retval R_CAN_SW_RST_ERR        The CAN peripheral did not enter Reset mode.\n
* See also R_CAN_PortSet() return values.
* @details Other than calling this API to enter Halt mode, CAN mode transitions are called via the other API
* functions automatically. For example, the default mode when starting up is CAN Sleep mode. Use the API to switch
* to other operating modes, for example first 'Exit Sleep' followed by 'Reset' to initialize the CAN registers for
* bitrate and interrupts, then enter ‘Halt' mode to configure mailboxes.
*/
uint32_t R_CAN_Control(const uint32_t  ch_nr, const uint32_t  action_type)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;
    uint32_t    api_status = R_CAN_OK;
    uint32_t    can_tmo_cnt = MAX_CAN_SW_DELAY;

    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    switch (action_type)
    {
        case EXITSLEEP_CANMODE:

            /* Set to Not Sleep, and ensure that RCAN exits in Operate mode.
            HW manual note says to write to the SLPM bit in CAN Halt mode,
            but if we currently are in Sleep mode, we should already also be
            in Halt mode. (See ENTERSLEEP_CANMODE below). */
            can_block_p->CTLR.BIT.SLPM = CAN_NOT_SLEEP;
            while ((can_block_p->STR.BIT.SLPST) && DEC_CHK_CAN_SW_TMR)
            {
                R_BSP_NOP();
            }
            if (0 == can_tmo_cnt)
            { 
                api_status = R_CAN_SW_WAKEUP_ERR;
            }
            R_CAN_Control(ch_nr, OPERATE_CANMODE);
            break;
        case ENTERSLEEP_CANMODE:

            /* Set to, and ensure that RCAN returns in, the Sleep state.
            Write to the SLPM bit in CAN Reset or CAN Halt modes. */
            api_status = R_CAN_Control(ch_nr, HALT_CANMODE);

            can_block_p->CTLR.BIT.SLPM = CAN_SLEEP;
            while ((!can_block_p->STR.BIT.SLPST) && DEC_CHK_CAN_SW_TMR)
            {
                R_BSP_NOP();
            }
            if (0 == can_tmo_cnt)
            {
                api_status = R_CAN_SW_SLEEP_ERR;
            }
        break;

        case RESET_CANMODE:

            /* Set to, and ensure that RCAN returns in, the Reset state. */
            can_block_p->CTLR.BIT.CANM = CAN_RESET;
            while ((!can_block_p->STR.BIT.RSTST) && DEC_CHK_CAN_SW_TMR)
            {
                /* Wait loop. */ ;
            }
            if (0 == can_tmo_cnt)
            {
                api_status = R_CAN_SW_RST_ERR;
            }
        break;

        case HALT_CANMODE:

            /* Set to, and ensure that RCAN returns in, the Halt state. */
            /* The CAN module enters CAN Halt mode after waiting for the end of 
            message reception or transmission. */
            can_block_p->CTLR.BIT.CANM = CAN_HALT;
            while ((!can_block_p->STR.BIT.HLTST) && DEC_CHK_CAN_SW_TMR)
            {
                /* Wait loop. */ ;
            }
            if (0 == can_tmo_cnt)
            {
                api_status = R_CAN_SW_HALT_ERR;
            }
        break;

        case OPERATE_CANMODE:  

            /* Take CAN out of Stop mode. */    
            can_module_stop_state_cancel(ch_nr); /* exit module stop state */

            /* Set to Operate mode. */
            can_block_p->CTLR.BIT.CANM = CAN_OPERATION;

            /* Ensure that RCAN is in Operation mode. */
            while (((can_block_p->STR.BIT.HLTST) || (can_block_p->STR.BIT.RSTST)) && DEC_CHK_CAN_SW_TMR)
            {
                /* Wait loop. */ ;
            }
            if (0 == can_tmo_cnt)
            {
                api_status = R_CAN_SW_RST_ERR;
            }
        break;
        default:
            api_status = R_CAN_BAD_ACTION_TYPE;
        break;
    }

