pwbf/RX64M_CANBUS/src/r_can_rx/src/r_can_rx.c
    return (api_status);
}
/******************************************************************************
 End of function R_CAN_Control
 *****************************************************************************/ /* end R_CAN_Control() */

/***********************************************************************************************************************
* Function Name: R_CAN_TxSet
********************************************************************************************************************//**
* @brief Set up a mailbox to transmit. The API will write to a mailbox the specified ID, data length and data
* frame payload, then set the mailbox to transmit mode and send a frame onto the bus by calling R_CAN_Tx().\n
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mbox_nr - Mailbox to use.
* @param[in] frame_p - Pointer to a data frame structure in memory. It is an address to the data structure containing
* the ID, DLC and data that constitute the data frame the mailbox will transmit.
* @param[in] frame_type \n
*  DATA_FRAME  Send a normal data frame.\n
*  REMOTE_FRAME    Send a remote data frame request.
* @retval R_CAN_OK                The mailbox was set up for transmission.
* @retval R_CAN_SW_BAD_MBX        Bad mailbox number.
* @retval R_CAN_BAD_CH_NR         The channel number does not exist.
* @retval R_CAN_BAD_ACTION_TYPE   No such action type exists for this function.
* @details This function first waits for any previous transmission of the specified mailbox to complete. It then
* interrupt disables the mailbox temporarily when setting up the mailbox: Sets the ID value for the mailbox, the
* Data Length Code indicated by frame_p, selects data frame or remote frame request and finally copies the data frame
* payload bytes (0-7) into the mailbox. The mailbox is interrupt enabled again unless USE_CAN_POLL was defined.
* Finally R_CAN_Tx is called to deliver the message.
*/
uint32_t R_CAN_TxSet(const uint32_t         ch_nr,
                     const uint32_t         mbox_nr,
                     const can_frame_t*     frame_p,
                     const uint32_t         frame_type)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;
    uint32_t    api_status = R_CAN_OK;
    uint32_t    i;

    CHECK_MBX_NR
    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    /* Wait for any previous transmission to complete. */
    api_status = can_wait_tx_rx(ch_nr, mbox_nr);

    /* Interrupt disable the mailbox.in case it was a receive mailbox */
    can_block_p->MIER.LONG &= ((~(bit_set[mbox_nr])));

    /* Clear message mailbox control register. TRMREQ/RECREQ already 0 after can_wait_tx_rx(). (No need to write twice). */
    can_block_p->MCTL[mbox_nr].BYTE = 0;
        
    /*** Set Mailbox ID based on ID mode ***/
    if (frame_p->id & XID_MASK)    /* Check for XID flag bit set in ID field */
    {
        /* Set message mailbox buffer Extended ID, masking off temporary XID flag bit. */
        can_block_p->MB[mbox_nr].ID.LONG = (frame_p->id & (~XID_MASK));
        if (MIXED_ID_MODE == can_block_p->CTLR.BIT.IDFM)
        {
            can_block_p->MB[mbox_nr].ID.BIT.IDE = 1;   /* Mixed mode; select to send extended frame. */
        }
    }
    else
    {
        /* Set message mailbox buffer Standard ID. Put only the lower 11 bit in the SID. */
        can_block_p->MB[mbox_nr].ID.BIT.SID = (frame_p->id & SID_MASK);

        /* Always set IDE to 0 (unless mixed mode and extended frame as above). */
        can_block_p->MB[mbox_nr].ID.BIT.IDE = 0;
    }

    /* Set the Data Length Code */
    can_block_p->MB[mbox_nr].DLC = (unsigned short)frame_p->dlc;

    /* Frame select: Data frame = 0, Remote = 1 */
    if (REMOTE_FRAME == frame_type)
    {
        can_block_p->MB[mbox_nr].ID.BIT.RTR = 1;
    }
    else
    {
        can_block_p->MB[mbox_nr].ID.BIT.RTR = 0;
    }

    /* Copy frame data into mailbox */
    for (i = 0; ((i < frame_p->dlc) && (i<8)); i++)
    {
        can_block_p->MB[mbox_nr].DATA[i] = frame_p->data[i];
    }

    #if (USE_CAN_POLL == 0)
        /* Interrupt enable the mailbox */
        can_block_p->MIER.LONG |= (bit_set[mbox_nr]);
    #endif

    api_status |= R_CAN_Tx(ch_nr, mbox_nr);

    return (api_status);
}
/******************************************************************************
 End of function R_CAN_TxSet
 *****************************************************************************/ /* end R_CAN_TxSet() */

/***********************************************************************************************************************
* Function Name: R_CAN_TxSetXid
********************************************************************************************************************//**
* @brief Set up a mailbox to transmit.The API will write to a mailbox the specified ID, data length and data
* frame payload, then set the mailbox to transmit mode and send a frame onto the bus by calling R_CAN_Tx(). If this
* function is used, the ID will be a 29-bit ID.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mbox_nr - Mailbox to use.
* @param[in] frame_p - Pointer to a data frame structure in memory. It is an address to the data structure containing
* the ID, DLC and data that constitute the dataframe the mailbox will transmit.
* @param[in] frame_type \n
*  DATA_FRAME  Send a normal data frame.\n
*  REMOTE_FRAME    Send a remote data frame request.
* @retval R_CAN_OK                The mailbox was set up for transmission.
* @retval R_CAN_SW_BAD_MBX        Bad mailbox number.
* @retval R_CAN_BAD_CH_NR         The channel number does not exist.
* @retval R_CAN_BAD_ACTION_TYPE   No such action type exists for this function.
* @details This function first waits for any previous transmission of the specified mailbox to complete. It then
* interrupt disables the mailbox temporarily when setting up the mailbox: Sets the ID value for the mailbox, the
* Data Length Code indicated by frame_p, selects dataframe or remote frame request and finally copies the data frame
* payload bytes (0-7) into the mailbox. The mailbox is interrupt enabled again unless USE_CAN_POLL was defined.
* Finally R_CAN_Tx is called to deliver the message.
*/
uint32_t R_CAN_TxSetXid(const uint32_t     ch_nr, 
                        const uint32_t     mbox_nr,
                        can_frame_t*       frame_p,
                        const uint32_t     frame_type)
{
    can_frame_t temp_frame;
    uint32_t    api_status;

