pwbf/RX64M_CANBUS/src/r_can_rx/src/r_can_rx.c
    /* Copy the user frame to a temporary frame to which we add the Xid bit, 
    so that 29-bit ID will be used by R_CAN_TxSet(). The original frame is left 
    untouched (in case user later wants to send the same frame with standard ID). */
    memcpy(&temp_frame, frame_p, sizeof(can_frame_t));

    temp_frame.id |= XID_MASK;    /* Set XID flag bit set in ID field */
    api_status = R_CAN_TxSet(ch_nr, mbox_nr, (can_frame_t*)&temp_frame, frame_type);
           
    return (api_status);
}
/******************************************************************************
 End of function R_CAN_TxSetXid
 *****************************************************************************//* end R_CAN_TxSetXid() */

/***********************************************************************************************************************
* Function Name: R_CAN_Tx
********************************************************************************************************************//**
* @brief Starts actual message transmission onto the CAN bus. This API will wait until the mailbox finishes handling
* a prior frame, then set the mailbox to transmit mode.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mbox_nr - Which CAN mailbox to use. (0-32)
* @retval R_CAN_OK - The mailbox was set to transmit a previously configured mailbox.
* @retval R_CAN_SW_BAD_MBX - Bad mailbox number.
* @retval R_CAN_BAD_CH_NR - The channel number does not exist.
* @retval R_CAN_SW_SET_TX_TMO - Waiting for previous transmission to finish timed out.
* @retval R_CAN_SW_SET_RX_TMO - Waiting for previous reception to complete timed out.
* @details R_CAN_TxSet must have been called at least once for this mailbox after system start to set up the mailbox
* content, as this function only tells the mailbox to send its content.
*/
uint32_t R_CAN_Tx(const uint32_t  ch_nr, const uint32_t  mbox_nr)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;
    uint32_t api_status = R_CAN_OK;

    CHECK_MBX_NR
    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    /* Wait for any previous transmission to complete. */
    api_status = can_wait_tx_rx(ch_nr, mbox_nr);

    /* Clear SentData flag since we are about to send anew.
     * Do a byte-write to avoid read-modify-write with HW writing another bit inbetween. See RX64M/71M UM 43.2.8.
     * TRMREQ/RECREQ already 0 after can_wait_tx_rx(). (No need to write twice). */
    can_block_p->MCTL[mbox_nr].BYTE = 0;

    /* Set TrmReq bit to "1" */
    can_block_p->MCTL[mbox_nr].BIT.TX.TRMREQ = 1;

    return (api_status);
}
/******************************************************************************
 End of function R_CAN_Tx
 *****************************************************************************/ /* end R_CAN_Tx() */

/***********************************************************************************************************************
* Function Name: R_CAN_TxCheck
********************************************************************************************************************//**
* @brief Check for successful data frame transmission. Use to check a mailbox for a successful data frame transmission.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mbox_nr - Which CAN mailbox to use. (0-32)
* @retval R_CAN_OK            Transmission was completed successfully.
* @retval R_CAN_SW_BAD_MBX    Bad mailbox number.
* @retval R_CAN_BAD_CH_NR     The channel number does not exist.
* @retval R_CAN_MSGLOST       Message was overwritten or lost.
* @retval R_CAN_NO_SENTDATA   No message was sent.
* @details This function is only needed if an application needs to verify that a message has been transmitted for
* example so that it can progress a state machine, or if messages are sent back-to-back. With CAN’s level of transport
* control built into the silicon, it can reasonably be assumed that once a mailbox has been asked to send with the API
* that the message will indeed be sent. Safest if of course to use this function after a transmission.
*/
uint32_t R_CAN_TxCheck(const uint32_t ch_nr, const uint32_t mbox_nr)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;
    uint32_t api_status = R_CAN_OK;

    CHECK_MBX_NR
    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    /* Read and clear SentData flag. */
    if (0 == can_block_p->MCTL[mbox_nr].BIT.TX.SENTDATA)
    {
        api_status = R_CAN_NO_SENTDATA;
    }
    else
    {
        /* Clear SENTDATA.
         * Do a byte-write to avoid read-modify-write with HW writing another bit inbetween. See RX64M/71M UM 43.2.8.
         * TRMREQ must be set to 0 (or will send again).
         * Do it twice since "Bits SENTDATA and TRMREQ cannot be set to 0 simultaneously." */
        can_block_p->MCTL[mbox_nr].BYTE = 0;
        can_block_p->MCTL[mbox_nr].BYTE = 0;
    }

    return (api_status);
}
/******************************************************************************
 End of function R_CAN_TxCheck
 *****************************************************************************/ /* end R_CAN_TxCheck() */

/***********************************************************************************************************************
* Function Name: R_CAN_TxStopMsg
********************************************************************************************************************//**
* @brief Stop a mailbox that has been asked to transmit a frame
* @param[in] ch_nr \n
*    CAN channel to use (0-2 MCU dependent).
* @param[in] mbox_nr \n
*    Which CAN mailbox to use. (0-32)
* @retval R_CAN_OK            Action completed successfully.
* @retval R_CAN_SW_BAD_MBX    Bad mailbox number.
* @retval R_CAN_BAD_CH_NR     The channel number does not exist.
* @retval R_CAN_SW_ABORT_ERR  Waiting for an abort timed out.
* @details This function clears the mailbox control flags so that a transmission is stopped (TrmReq is set to 0.)
* A software counter then waits for an abort for a maximum period of time.\n
* If the message was not stopped, R_CAN_SW_ABORT_ERR is returned. Note that the cause of this could be that the
* message was already sent.
*/
uint32_t R_CAN_TxStopMsg(const uint32_t ch_nr, const uint32_t mbox_nr)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;
    uint32_t api_status = R_CAN_OK;
    uint32_t can_tmo_cnt = MAX_CAN_SW_DELAY;
    
    CHECK_MBX_NR
    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    /* Clear message mailbox control register. Setting TRMREQ to 0 should abort. Do a byte-write to avoid read-modify-write with HW writing another bit inbetween. See RX64M/71M UM 43.2.8.
     * Do it twice since "Bits SENTDATA and TRMREQ cannot be set to 0 simultaneously." */
    can_block_p->MCTL[mbox_nr].BYTE = 0;
    can_block_p->MCTL[mbox_nr].BYTE = 0;

    /* Wait for abort. */
    while ((can_block_p->MCTL[mbox_nr].BIT.TX.TRMABT) && DEC_CHK_CAN_SW_TMR)
    {;}
    if (0 == can_tmo_cnt)
    {
        api_status = R_CAN_SW_ABORT_ERR;
    }

