pwbf/RX64M_CANBUS/src/r_can_rx/src/r_can_rx.c
/***********************************************************************************************************************
* Function Name: R_CAN_RxPoll
********************************************************************************************************************//**
* @brief Checks if a mailbox has received a message
* @param[in] ch_nr \n
*               CAN channel to use (0-2 MCU dependent).
* @param[in] mbox_nr \n
*               Which CAN mailbox to check (0-32).
* @retval R_CAN_OK            There is a message waiting.
* @retval R_CAN_NOT_OK        No message waiting.
* @retval R_CAN_RXPOLL_TMO    Message pending but timed out.
* @retval R_CAN_SW_BAD_MBX    Bad mailbox number.
* @retval R_CAN_BAD_CH_NR     The channel number does not exist.
* @details When a mailbox is set up to receive certain messages, it is important to determine when it has finished
* receiving successfully. There are two methods for doing this: \n
* Polling. Call the API regularly to check for new messages. USE_CAN_POLL must be defined in the CAN configuration
* file. If there is a message use R_CAN_RxRead to fetch it. \n
* Using the CAN receive interrupt (USE_CAN_POLL not defined): Use this API to check which mailbox received. Then
* notify the application. \n
* The function returns R_CAN_OK if new data was found in the mailbox.
*
*/
uint32_t R_CAN_RxPoll(const uint32_t  ch_nr, const uint32_t  mbox_nr)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;
    uint32_t api_status = R_CAN_NOT_OK;
    uint32_t poll_delay = MAX_CANREG_POLLCYCLES;

    CHECK_MBX_NR
    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    /* Wait if new data is currently being received. */
    while ((can_block_p->MCTL[mbox_nr].BIT.RX.INVALDATA) && poll_delay)
    {
        poll_delay--;
    }

    if (0 == poll_delay)    /* Still updating mailbox. Come back later. */
    {
        api_status = R_CAN_RXPOLL_TMO;
    }
    else /* Message received? */
    {
        /* If message received, tell user. */
        if (1 == can_block_p->MCTL[mbox_nr].BIT.RX.NEWDATA)
            api_status = R_CAN_OK;
    }
    return (api_status);
}
/******************************************************************************
 End of function R_CAN_RxPoll
 *****************************************************************************//* end R_CAN_RxPoll() */

/***********************************************************************************************************************
* Function Name: R_CAN_RxRead
********************************************************************************************************************//**
* @brief Read the CAN data frame content from a mailbox. The API checks if a given mailbox has received a message.
* If so, a copy of the mailbox’s dataframe will be written to the given structure.
* @param[in] ch_nr \n
*               CAN channel to use (0-2 MCU dependent).
* @param[in] mbox_nr \n
*               Which CAN mailbox to check (0-32).
* @param[in] frame_p \n
*              Refers to a pointer to a data frame structure in memory. It is an address to the data structure into
*              which the function will place a copy of the mailbox’s received CAN data frame.
* @retval R_CAN_OK            There is a message waiting.
* @retval R_CAN_SW_BAD_MBX    Bad mailbox number.
* @retval R_CAN_BAD_CH_NR     The channel number does not exist.
* @retval R_CAN_MSGLOST       Message was overwritten or lost.
* @details Use R_CAN_RxPoll() first to check whether the mailbox has received a message. \n
* This function is used to fetch the message from a mailbox, either when using polled mode or from a CAN receive
* interrupt.

*/
uint32_t R_CAN_RxRead(const uint32_t       ch_nr,
                      const uint32_t       mbox_nr,
                      can_frame_t* const   frame_p)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;
    uint32_t i;
    uint32_t api_status = R_CAN_OK;

    CHECK_MBX_NR
    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    /* EXT_ID_MODE */
    /* Copy received data from message mailbox to memory. The IDE bit is only valid in mixed mode. */
    if (EXT_ID_MODE == can_block_p->CTLR.BIT.IDFM)
    {
        /* Get mailbox Extended ID, keeping only lower 29 bits. */
        frame_p->id = (can_block_p->MB[mbox_nr].ID.LONG & (~XID_MASK)); 
    }
    /* MIXED_ID_MODE */
    else if (MIXED_ID_MODE == can_block_p->CTLR.BIT.IDFM)
    {
        if (1 == can_block_p->MB[mbox_nr].ID.BIT.IDE) /* Check for XID control bit set. */
        {
            /* Get mailbox Extended ID, keeping only lower 29 bits. */
            frame_p->id = (can_block_p->MB[mbox_nr].ID.LONG & (~XID_MASK));
        }
        else
        {
            /* Get only the lower 11 bits from the SID. */
            frame_p->id = can_block_p->MB[mbox_nr].ID.BIT.SID;
        }
    }
    /* STD_ID_MODE */
    else
    {
        /* Get lower 11 bits from SID. */
        frame_p->id = can_block_p->MB[mbox_nr].ID.BIT.SID;
    }

    frame_p->dlc = (uint8_t)can_block_p->MB[mbox_nr].DLC;

    for (i = 0; i < can_block_p->MB[mbox_nr].DLC; i++)
    {
        frame_p->data[i] = can_block_p->MB[mbox_nr].DATA[i];
    }

    /* Check if message was lost/overwritten. */
    if (can_block_p->MCTL[mbox_nr].BIT.RX.MSGLOST)
    {
        api_status = R_CAN_MSGLOST;
    }

    /* Clear MSGLOST.
     * Also set NEWDATA to 0 since the mailbox was just emptied and start over with new RxPolls.
     * Do a byte-write to avoid read-modify-write with HW writing another bit inbetween. See RX64M/71M UM 43.2.8.*/
    can_block_p->MCTL[mbox_nr].BYTE = 0x40;

    return (api_status);
}
/******************************************************************************
 End of function R_CAN_RxRead
 *****************************************************************************//* end R_CAN_RxRead() */

