pwbf/RX64M_CANBUS/src/r_can_rx/src/r_can_rx.c
        /* Mailbox interrupt enable registers. Disable interrupts for all slots. 
        They will be enabled individually by the API. */
        CAN0.MIER.LONG = 0x00000000;
#endif /* CAN_USE_CAN0 */
    }
#ifdef CAN1
#if (CAN_USE_CAN1 == 1)
    else if (1 == ch_nr)
    {
        R_BSP_InterruptRequestEnable(VECT(CAN1, TXM1)); /* 1 = interrupt enabled. */
        IPR(CAN1, TXM1) = CAN1_INT_LVL; /* priority */

        /* Configure CAN Rx interrupt. */
        R_BSP_InterruptRequestEnable(VECT(CAN1, RXM1));
        IPR(CAN1, RXM1) = CAN1_INT_LVL;

        /* Configure CAN Error interrupt. Must enable group that it belongs to */
        /* in addition to individual source. */
        R_BSP_InterruptRequestEnable(VECT(ICU, GROUPBE0));
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) 
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
        EN(CAN1, ERS1) = 1;  /* Resolves to:  ICU.GEN[GEN_CAN1_ERS1].BIT.EN1 = 1; */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) 
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
        ICU.IPR[IPR_ICU_GROUPBE0].BIT.IPR = CAN1_INT_LVL; /* EDIT */
        R_BSP_InterruptWrite(BSP_INT_SRC_BE0_CAN1_ERS1, (bsp_int_cb_t) can_err_callback[1]);

        /* Enable all CAN error interrupts. */
        CAN1.EIER.BYTE = 0xFF;

        /* Mailbox interrupt enable registers. Disable interrupts for all slots. 
        They will be enabled individually by the API. */
        CAN1.MIER.LONG = 0x00000000;
    }
#endif /* CAN_USE_CAN1 */
#endif /* CAN1 */
#ifdef CAN2
#if (CAN_USE_CAN2 == 1)
    else if (2 == ch_nr)
    {
        /* Configure CAN Tx interrupt. */
        R_BSP_InterruptRequestEnable(VECT(CAN2, TXM2)); /* 1 = interrupt enabled. */
        IPR(CAN2, TXM2) = CAN2_INT_LVL; /* priority */

        /* Configure CAN Rx interrupt. */
        R_BSP_InterruptRequestEnable(VECT(CAN2, RXM2));
        IPR(CAN2, RXM2) = CAN2_INT_LVL;

        /* Configure CAN Error interrupt. Must enable group that it belongs to */
        /* in addition to individual source. */
        R_BSP_InterruptRequestEnable(VECT(ICU, GROUPBE0)); /* Enable group JWP Edit */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) 
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
        EN(CAN2, ERS2) = 1; /* resolves to:  ICU.GEN[GEN_CAN2_ERS2].BIT.EN2 = 1; */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) 
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
        ICU.IPR[IPR_ICU_GROUPBE0].BIT.IPR = CAN2_INT_LVL;
        R_BSP_InterruptWrite(BSP_INT_SRC_BE0_CAN2_ERS2, (bsp_int_cb_t) can_err_callback[2]);

        /* Enable all CAN error interrupts. */
        CAN2.EIER.BYTE = 0xFF;

        /* Mailbox interrupt enable registers. Disable interrupts for all slots.
        They will be enabled individually by the API. */
        CAN2.MIER.LONG = 0x00000000;
    }
#endif /* CAN_USE_CAN2 */
#endif /* CAN2 */
#endif /* USE_CAN_POLL */
}
/******************************************************************************
 End of function config_can_interrupts
 *****************************************************************************//* end config_can_interrupts() */

#if !USE_CAN_POLL
/*********************************************************************************


        C A N   I N T E R R U P T S


**********************************************************************************/
#if (CAN_USE_CAN0 == 1)
/*****************************************************************************
Function name:  CAN0_TXM0_ISR
Parameters:     -
Returns:        -
Description:    CAN0 Transmit interrupt (channel 0).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN0_TXM0_ISR, VECT_CAN0_TXM0)    /* See mcu_mapped_interrupts.h. */
R_BSP_ATTRIB_INTERRUPT void CAN0_TXM0_ISR(void)
{
    can_tx_callback[0]();
}
/******************************************************************************
 End of function CAN0_TXM0_ISR
 *****************************************************************************//* end CAN0_TXM0_ISR() */

/*****************************************************************************
Function name:  CAN0_RXM0_ISR()
Parameters:     -
Returns:        -
Description:    CAN0 Receive interrupt (channel 1).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN0_RXM0_ISR, VECT_CAN0_RXM0)
R_BSP_ATTRIB_INTERRUPT void CAN0_RXM0_ISR(void)
{
    can_rx_callback[0]();
}
/******************************************************************************
 End of function CAN0_RXM0_ISR
 *****************************************************************************//* end CAN0_RXM0_ISR() */
#endif /* CAN_USE_CAN0 */
#ifdef CAN1
#if (CAN_USE_CAN1 == 1)
/*****************************************************************************
Function name:  CAN1_TXM1_ISR
Parameters:     -
Returns:        -
Description:    CAN1 Transmit interrupt (channel 1).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN1_TXM1_ISR, VECT_CAN1_TXM1)
R_BSP_ATTRIB_INTERRUPT void CAN1_TXM1_ISR(void)
{
    can_tx_callback[1]();
}
/******************************************************************************
 End of function CAN1_TXM1_ISR
 *****************************************************************************/ /* end CAN1_TXM1_ISR() */

/*****************************************************************************
Function name:  CAN1_RXM1_ISR()
Parameters:     -
Returns:        -
Description:    CAN1 Receive interrupt (channel 1).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN1_RXM1_ISR, VECT_CAN1_RXM1)
R_BSP_ATTRIB_INTERRUPT void CAN1_RXM1_ISR(void)
{
    can_rx_callback[1]();
}
/******************************************************************************
 End of function CAN1_RXM1_ISR
 *****************************************************************************/ /* end CAN1_RXM1_ISR() */
#endif /* CAN_USE_CAN1 */
#endif /* CAN1 */

#ifdef CAN2
#if (CAN_USE_CAN2 == 1)
/*Function name:  CAN2_TXM2_ISR
Parameters:     -
Returns:        -
Description:    CAN2 Transmit interrupt (channel 2).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN2_TXM2_ISR, VECT_CAN2_TXM2)    /* See mcu_mapped_interrupts.h. */
R_BSP_ATTRIB_INTERRUPT void CAN2_TXM2_ISR(void)
{
    can_tx_callback[2]();
}
/******************************************************************************
 End of function CAN2_TXM2_ISR
 *****************************************************************************/ /* end CAN2_TXM2_ISR() */

/*****************************************************************************
Name:           CAN2_RXM2_ISR()
Parameters:     -
Returns:        -
Description:    CAN2 Receive interrupt (channel 2).
*****************************************************************************/
R_BSP_PRAGMA_INTERRUPT(CAN2_RXM2_ISR, VECT_CAN2_RXM2)    /* See mcu_mapped_interrupts.h. */
R_BSP_ATTRIB_INTERRUPT void CAN2_RXM2_ISR(void)
{
    can_rx_callback[2]();
}
/******************************************************************************
 End of function CAN2_RXM2_ISR
 *****************************************************************************//* end CAN2_RXM2_ISR() */
#endif /* CAN_USE_CAN2 */
#endif /* CAN2 */

#endif /* USE_CAN_POLL */

/*****************************************************************************
Function name:  universal_can_callback
Parameters:     -
Returns:        -
Description:    Callback in case user did not provide one. Will execute for
                ALL CAN interrupts! Probably not what you want. See CAN API
                application note.
*****************************************************************************/
void universal_can_callback(void)
{
    R_BSP_NOP();
}
/******************************************************************************
 End of function universal_can_callback
 *****************************************************************************/
/* end universal_can_callback() */

/* file end */